---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AreaLoad..::..Create Method
AreaLoad Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, ElementId, XYZ, AreaLoadType) | Creates a new hosted area load within the project. |
|  | Create(Document, ElementId, IList<(Of <<'(CurveLoop>)>>), XYZ, AreaLoadType) | Creates a new custom area load within the project. |
|  | Create(Document, ElementId, IList<(Of <<'(CurveLoop>)>>), IList<(Of <<'(XYZ>)>>), IList<(Of <<'(Int32>)>>), IList<(Of <<'(Int32>)>>), AreaLoadType) | Creates a new custom area load within the project. |

# See Also

AreaLoad Class

AreaLoad Members

Autodesk.Revit.DB.Structure Namespace